In [1]:
print("Hello World");

Hello World

In [2]:
pip install numpy

Requirement already satisfied: numpy in c:\users\lenovo\appdata\local\programs\python\python312\lib\site-packages (1.26.4)
Note: you may need to restart the kernel to use updated packages.

In [3]:
print("Hello World");

Hello World

In [4]:
import numpy as np

import pandas as pd

In [5]:
dict={
    "name":['vikas','ran','shubham'],
    "marks":[10,20,30],
    "city":['hyd','sec','hyd']
}

In [6]:
print(dict);

{'name': ['vikas', 'ran', 'shubham'], 'marks': [10, 20, 30], 'city': ['hyd', 'sec', 'hyd']}

In [7]:
import pandas as pd
df=pd.DataFrame(dict)
print(df)

      name  marks city
0    vikas     10  hyd
1      ran     20  sec
2  shubham     30  hyd

In [8]:
# creating .csv file
df.to_csv('demo.csv',index=False)

In [12]:
df.to_csv('first.csv',index=False)

In [13]:
df

      name  marks city
0    vikas     10  hyd
1      ran     20  sec
2  shubham     30  hyd

In [14]:
df.head(2)

    name  marks city
0  vikas     10  hyd
1    ran     20  sec

In [15]:
df.tail(2) # Last two rows

      name  marks city
1      ran     20  sec
2  shubham     30  hyd

In [16]:
df.describe()

       marks
count    3.0
mean    20.0
std     10.0
min     10.0
25%     15.0
50%     20.0
75%     25.0
max     30.0

In [17]:
df.to_csv('demo.csv')

In [18]:
vikas = pd.read_csv('demo.csv')
vikas

   Unnamed: 0     name  marks city
0           0    vikas     10  hyd
1           1      ran     20  sec
2           2  shubham     30  hyd

In [19]:
vikas.head(2)

   Unnamed: 0   name  marks city
0           0  vikas     10  hyd
1           1    ran     20  sec

In [21]:
vikas['marks']

0    10
1    20
2    30
Name: marks, dtype: int64

In [22]:
vikas['marks'][0]

10

In [23]:
vikas['marks'][0]=50

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_12744\333991252.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  vikas['marks'][0]=50

In [24]:
vikas

   Unnamed: 0     name  marks city
0           0    vikas     50  hyd
1           1      ran     20  sec
2           2  shubham     30  hyd

In [25]:
vikas.describe()

       Unnamed: 0      marks
count         3.0   3.000000
mean          1.0  33.333333
std           1.0  15.275252
min           0.0  20.000000
25%           0.5  25.000000
50%           1.0  30.000000
75%           1.5  40.000000
max           2.0  50.000000

In [27]:
vikas.index=[1,2,3]

In [28]:
vikas

   Unnamed: 0     name  marks city
1           0    vikas     50  hyd
2           1      ran     20  sec
3           2  shubham     30  hyd